tap "adoptopenjdk/openjdk"
tap "caskroom/cask"
tap "caskroom/fonts"
tap "datawire/blackbird"
tap "gefyrahq/gefyra"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "txn2/tap"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Configurable static site generator
brew "hugo"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Production Grade K8s Installation, Upgrades, and Management
brew "kops"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Asynchronous event library
brew "libevent"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# HTTP/2 C Library
brew "nghttp2"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Platform built on V8 to build network applications
brew "node"
# General-purpose scripting language
brew "php@7.3", link: true
# Interpreted, interactive, object-oriented programming language
brew "python@3.8", link: false
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# User interface to the TELNET protocol
brew "telnet"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Local dev environment attached to a remote Kubernetes cluster
brew "datawire/blackbird/telepresence"
# Blazingly-fast, rock-solid, local application development with Kubernetes
brew "gefyrahq/gefyra/gefyra"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Kubernetes bulk port forwarding utility.
brew "txn2/tap/kubefwd"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk8"
# Redis desktop manager
cask "another-redis-desktop-manager"
# App to build and share containerized applications and microservices
cask "docker"
cask "font-sourcecodepro-nerd-font"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# HTTP client that helps testing and describing APIs
cask "paw"
# Control your tools with a few keystrokes
cask "raycast"
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Telegram", id: 747648890
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
