tap "adoptopenjdk/openjdk"
tap "caskroom/cask"
tap "caskroom/fonts"
tap "datawire/blackbird"
tap "gefyrahq/gefyra"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "txn2/tap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Official Amazon AWS command-line interface
brew "awscli"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# C library implementing the SSH2 protocol
brew "libssh2"
# Open source suite of directory software
brew "openldap"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Debugger for the Go programming language
brew "delve"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Database migrations CLI tool
brew "golang-migrate"
# GNU troff text-formatting system
brew "groff"
# Kubernetes package manager
brew "helm"
# Configurable static site generator
brew "hugo"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Production Grade K8s Installation, Upgrades, and Management
brew "kops"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Asynchronous event library
brew "libevent"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# HTTP/2 C Library
brew "nghttp2"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Platform built on V8 to build network applications
brew "node"
# Python package management tool
brew "poetry"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Go support for Google's protocol buffers
brew "protoc-gen-go"
# Protoc plugin that generates code for gRPC-Go clients
brew "protoc-gen-go-grpc"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9", link: false
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# User interface to the TELNET protocol
brew "telnet"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Local dev environment attached to a remote Kubernetes cluster
brew "datawire/blackbird/telepresence"
# Blazingly-fast, rock-solid, local application development with Kubernetes
brew "gefyrahq/gefyra/gefyra"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Kubernetes bulk port forwarding utility.
brew "txn2/tap/kubefwd"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk8"
# Web browser
cask "alex313031-thorium"
# Memory training application
cask "anki"
# Redis desktop manager
cask "another-redis-desktop-manager"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-sourcecodepro-nerd-font"
# Go (golang) IDE
cask "goland"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# IDE for Python programming - Community Edition
cask "pycharm-ce"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Control your tools with a few keystrokes
cask "raycast"
# IDE, client, and GUI for MongoDB
cask "studio-3t"
# Native GUI tool for relational databases
cask "tableplus"
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Telegram", id: 747648890
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
mas "解壓專家Oka", id: 1441507725
vscode "beaugunderson.solidity-extended"
vscode "codeium.codeium"
vscode "golang.go"
vscode "hosho.solidity-debugger"
vscode "ipedrazas.kubernetes-snippets"
vscode "juanblanco.solidity"
vscode "lunuan.kubernetes-templates"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "octref.vetur"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "twxs.cmake"
vscode "yzane.markdown-pdf"
